{"Tweets":"@WEARLauraHussey did hurricane Michael help with the red tide in the gulf at all?"}
{"Tweets":"RT @NR1620: Gulf Power Company Expects Power Restoration to 95% of All Hurricane Michael Customers 14 Days After Storm.  \n\nGulf Power annou…"}
{"Tweets":"Shelter animals impacted by Hurricane Michael brought to Pensacola\n\nPENSACOLA, Fla. (WEAR) — Dozens of cats and dog… https:\/\/t.co\/u6ikuRuVng"}
{"Tweets":"U.S. Army Combat Photographer SPC Scott Hagan’s Photos of Hurricane Michael’s Hit on His Home Town of Marianna, Flo… https:\/\/t.co\/wTCvdiJlSi"}
{"Tweets":"RT @GulfPower: @PeterSchorschFL @DrewWilsonFL \"Gulf Power announces that by midnight, Oct. 24, fourteen days after landfall of Hurricane Mi…"}
{"Tweets":"@PeterSchorschFL @DrewWilsonFL \"Gulf Power announces that by midnight, Oct. 24, fourteen days after landfall of Hur… https:\/\/t.co\/ByXCKQtkdV"}
{"Tweets":"@Fla_Pol @DrewWilsonFL \"Gulf Power announces that by midnight, Oct. 24, fourteen days after landfall of Hurricane M… https:\/\/t.co\/C0HVqraGsz"}
{"Tweets":"Tyndall will recover after Hurricane Michael, senator vows https:\/\/t.co\/2sGy1BJf8D https:\/\/t.co\/IGfLfBqXkw"}
{"Tweets":"@wowairsupport I live in Panama city Beach Florida. We have no cell service and the wow wires have been blown down… https:\/\/t.co\/6IiYDkniPc"}
{"Tweets":"TEST FOR RED TIDE\/ HURRICANE MICHAEL... YES ??? , https:\/\/t.co\/J2yghHuiWN"}
{"Tweets":"Florida tourism industry sees resiliency tested in Hurricane Michael, water quality crises https:\/\/t.co\/4IG4KMOX5j"}
{"Tweets":"Gulf Power Company Expects Power Restoration to 95% of All Hurricane Michael Customers 14 Days After Storm.  \n\nGulf… https:\/\/t.co\/E1XD9meSNF"}
{"Tweets":"FEMA focused on 'sustaining life' in short term after Hurricane Michael https:\/\/t.co\/OsrTEzzxpO https:\/\/t.co\/pDg74v7iot"}
{"Tweets":"Hello everyone, if you or someone you know has been displaced by Hurricane Michael and they are looking for work, E… https:\/\/t.co\/4QuAj8SI3A"}
{"Tweets":"FEMA focused on 'sustaining life' in short term after Hurricane Michael https:\/\/t.co\/9fJ6G0Dm7O https:\/\/t.co\/6T4lZI5MXO"}
{"Tweets":"Aerial photos of Panama City, Mexico Beach damage https:\/\/t.co\/PkMMnDu99A https:\/\/t.co\/1eltlmus3V"}
{"Tweets":"Hurricane Michael: Escambia County Animal Shelter takes in dogs, cats from Bay County #news https:\/\/t.co\/jnVwGFCbpo"}
{"Tweets":"RT @pnj: Days after Hurricane Michael devastated parts of the Florida Panhandle, a child psychiatrist said children need normalcy and a sen…"}
{"Tweets":"RT @pnj: Days after Hurricane Michael devastated parts of the Florida Panhandle, a child psychiatrist said children need normalcy and a sen…"}
{"Tweets":"RT @pnj: Days after Hurricane Michael devastated parts of the Florida Panhandle, a child psychiatrist said children need normalcy and a sen…"}
{"Tweets":"RT @pnj: Days after Hurricane Michael devastated parts of the Florida Panhandle, a child psychiatrist said children need normalcy and a sen…"}
{"Tweets":"RT @pnj: Days after Hurricane Michael devastated parts of the Florida Panhandle, a child psychiatrist said children need normalcy and a sen…"}
{"Tweets":"Days after Hurricane Michael devastated parts of the Florida Panhandle, a child psychiatrist said children need nor… https:\/\/t.co\/iOKBVVsiie"}
{"Tweets":"If you are looking for a way to get 100% of the money and or supplies to the victims of Hurricane Michael we are wo… https:\/\/t.co\/fQ8qpSujcU"}
{"Tweets":"RT @cannonballerz_n: Proud of my boss @TerronJernigan and 2 team members @IHXRex and @IhxBrownie for heading to the Panama City area to pro…"}
{"Tweets":"The Santa Rosa County Marching Exhibition has been canceled by the directors due to the rehearsal dates that were m… https:\/\/t.co\/MMpiVVRg1U"}
{"Tweets":"Along with fish kill offs, red tide is also known for causing respiratory issues in humans.\n\nhttps:\/\/t.co\/17DzqBQ09z"}
{"Tweets":"RT @pnj: Hurricane Michael leaves children dealing with trauma, parents struggling to restore stability https:\/\/t.co\/v09aato3Wj https:\/\/t.c…"}
{"Tweets":"Hurricane Michael leaves children dealing with trauma, parents struggling to restore stability… https:\/\/t.co\/IOOuaHEu2f"}
{"Tweets":"Pilot Lt. Jason Nunley said the views looked \"like a bomb crater.\"\nhttps:\/\/t.co\/Cfx0BzpmoJ"}
{"Tweets":"RT @GulfPower: Line crews across Northwest Florida have restored power to more than 40,000 Gulf Power customers in the wake of Hurricane Mi…"}
{"Tweets":"@AndrewGillum I just want to thank you for everything you are doing. Since *Judge Kavanaugh was confirmed and now H… https:\/\/t.co\/olrV6K5nr2"}
{"Tweets":"THANK YOU, Mickey Mouse!❤️🙌🏻\nhttps:\/\/t.co\/5zkQn4ENzt @Disney @WaltDisneyWorld @marcorubio #HurricaneMichael"}
{"Tweets":"Scientists uncertain about Hurricane Michael's impact on spread of red tide to Pensacola https:\/\/t.co\/tkUqDgIvGJ https:\/\/t.co\/QA89uwGOiD"}
{"Tweets":"RT @pnj: Hurricane Michael: Civil Air Patrol flying missions from Pensacola to survey damage https:\/\/t.co\/EV4jeiPq1J https:\/\/t.co\/VWizgsas1F"}
{"Tweets":"Any donations you can make - would go towards getting the much needed supplies to help aid those trying to recover… https:\/\/t.co\/skJl6CB9pr"}
{"Tweets":"Hurricane Michael: Civil Air Patrol flying missions from Pensacola to survey damage https:\/\/t.co\/EV4jeiPq1J https:\/\/t.co\/VWizgsas1F"}
{"Tweets":"Hurricane Michael: Escambia County Animal Shelter takes in dogs, cats from Bay County https:\/\/t.co\/8uWwEsba5y"}
{"Tweets":"RT @GulfPower: Line crews across Northwest Florida have restored power to more than 40,000 Gulf Power customers in the wake of Hurricane Mi…"}
{"Tweets":"RT @GulfPower: Line crews across Northwest Florida have restored power to more than 40,000 Gulf Power customers in the wake of Hurricane Mi…"}
{"Tweets":"Hurricane Michael: Help People and Pets Now  https:\/\/t.co\/7wm0m7WHuh"}
{"Tweets":"RT @GulfPower: Line crews across Northwest Florida have restored power to more than 40,000 Gulf Power customers in the wake of Hurricane Mi…"}
{"Tweets":"Line crews across Northwest Florida have restored power to more than 40,000 Gulf Power customers in the wake of Hur… https:\/\/t.co\/EjmhKn8WZT"}
{"Tweets":"The historic Bay County Courthouse bent— but did not break —from the fury of Hurricane Michael.  Likewise the legal… https:\/\/t.co\/GKJXTyny63"}
{"Tweets":"RT @cannonballerz_n: Proud of my boss @TerronJernigan and 2 team members @IHXRex and @IhxBrownie for heading to the Panama City area to pro…"}
{"Tweets":"RT @pnj: Hurricane Michael: Escambia County Animal Shelter takes in dogs, cats from Bay County https:\/\/t.co\/NPX5GQmEVu https:\/\/t.co\/9B584Vf…"}
{"Tweets":"Thank you Mickey Mouse!🙌🏻❤️🎉 https:\/\/t.co\/5zkQn4ENzt #HurricaneMichael"}
{"Tweets":"https:\/\/t.co\/r8OnqgZ0I0"}
{"Tweets":"@FluffzCinnamon https:\/\/t.co\/r8OnqgZ0I0"}
{"Tweets":"@zoelifejoe1 https:\/\/t.co\/r8OnqgZ0I0"}
{"Tweets":"@susie3z https:\/\/t.co\/r8OnqgZ0I0"}
{"Tweets":"@cverbecks https:\/\/t.co\/r8OnqgZ0I0"}
{"Tweets":"Hurricane Michael: Help People and Pets Now – The Animal Rescue Site https:\/\/t.co\/7wm0m7WHuh"}
