{"Tweets":"WRBL News 3 will team up with Chattahoochee Harley Davidson in Columbus for a Hurricane Michael Relief Drive later… https:\/\/t.co\/4muJMAyqRo"}
{"Tweets":"RT SESLions \"SES, LES, and LPS are taking up donations to help communities affected by Hurricane Michael! You can d… https:\/\/t.co\/Bvlx5iyQsK"}
{"Tweets":"SES, LES, and LPS are taking up donations to help communities affected by Hurricane Michael! You can drop off any d… https:\/\/t.co\/9TgQgznq6X"}
{"Tweets":"NEWS 3 to host Hurricane Michael Relief Drive https:\/\/t.co\/eSDmu5Ek4M"}
{"Tweets":"Terrell County and Dawson hit hard by Hurricane Michael https:\/\/t.co\/gaSMLlptZn"}
{"Tweets":"I pray everyone affected by hurricane Michael stay strong"}
{"Tweets":"Helping Others!!!\n\nI received a few requests from friends that are collecting essential items for the families affe… https:\/\/t.co\/w6pSU8GiK6"}
{"Tweets":"Why are we not hearing about the over 1,500 people that are missing after hurricane Michael?"}
{"Tweets":"RT @WTVM: ICYMI: A group from Auburn\/ Opelika travels to Panama City beach to help evacuate patients at a damaged hospital following Hurric…"}
{"Tweets":"RT @WXTX54: ICYMI: A group from Auburn\/ Opelika travels to Panama City beach to help evacuate patients at a damaged hospital following Hurr…"}
{"Tweets":"RT @WTVM: ICYMI: A group from Auburn\/ Opelika travels to Panama City beach to help evacuate patients at a damaged hospital following Hurric…"}
{"Tweets":"ICYMI: A group from Auburn\/ Opelika travels to Panama City beach to help evacuate patients at a damaged hospital fo… https:\/\/t.co\/3kbhvHa1Mj"}
{"Tweets":"ICYMI: A group from Auburn\/ Opelika travels to Panama City beach to help evacuate patients at a damaged hospital fo… https:\/\/t.co\/NJcuY2pTdh"}
{"Tweets":"\"In your quiet time today, please remember those affected by hurricane Michael. Not everyone's home or loved ones m… https:\/\/t.co\/S0AzOplAMW"}
{"Tweets":"#PRESIDENT: The @POTUS plans to visit Georgia tomorrow to tour Hurricane Michael damage. @WTVM will be bringing you… https:\/\/t.co\/Txbya6Aekg"}
