{"Tweets":"During a press conference this afternoon, EMA officials discussed Hurricane Michael, and some of the precautions th… https:\/\/t.co\/Lwpos7RlRy"}
{"Tweets":"Hurricane Michael be a Category 4 at landfall at or around Panama City Beach. Time to take precautions and bunker d… https:\/\/t.co\/8FuDkenN77"}
{"Tweets":"Due to the impending threat of Hurricane Michael, our office will be closed Wednesday. We hope you and your family stay safe."}
{"Tweets":"#Michael\nNOAA's Hurricane Michael Briefing https:\/\/t.co\/8j3Utpp3Q9"}
{"Tweets":"RT @MetDavidPaul: Hurricane #Michael continues to strengthen, now a Category 3.  I wouldn't be surprised if it reaches 130 mph - a Cat 4 -…"}
{"Tweets":"RT @MetDavidPaul: Hurricane #Michael continues to strengthen, now a Category 3.  I wouldn't be surprised if it reaches 130 mph - a Cat 4 -…"}
{"Tweets":"RT @MetDavidPaul: Hurricane #Michael continues to strengthen, now a Category 3.  I wouldn't be surprised if it reaches 130 mph - a Cat 4 -…"}
{"Tweets":"Hurricane #Michael continues to strengthen, now a Category 3.  I wouldn't be surprised if it reaches 130 mph - a Ca… https:\/\/t.co\/iXcldTZYtd"}
{"Tweets":"@GovernorKayIvey Have you done what needs to be done to help us Alabama home owners in case of hurricane damage fro… https:\/\/t.co\/5kJrHI45S0"}
{"Tweets":"RT @mandymcqueentv: 4 PM NHC ADVISORY: #Michael has officially strengthened to a major category 3 hurricane with maximum sustained winds of…"}
{"Tweets":"RT @mandymcqueentv: The worst of Hurricane Michael will be passing through the Wiregrass tomorrow afternoon &amp; evening.\n\nHere's a checklist…"}
{"Tweets":"RT @mandymcqueentv: 4 PM NHC ADVISORY: #Michael has officially strengthened to a major category 3 hurricane with maximum sustained winds of…"}
{"Tweets":"Hurricane #Michael has strengthened to a Cat 3. https:\/\/t.co\/2Zp3Rc40mo"}
{"Tweets":"4 PM NHC ADVISORY: #Michael has officially strengthened to a major category 3 hurricane with maximum sustained wind… https:\/\/t.co\/CBwnYfhczQ"}
{"Tweets":"RT @dothaneagle: Some schools are announcing closings ahead of Hurricane Michael https:\/\/t.co\/goroPrJHM7 https:\/\/t.co\/8rksYkjQX4"}
{"Tweets":"RT @WDHN: Power trucks are currently lining the Florida state line as Hurricane Michael comes closer and closer.\n\nFor more updates on the s…"}
{"Tweets":"The worst of Hurricane Michael will be passing through the Wiregrass tomorrow afternoon &amp; evening.\n\nHere's a checkl… https:\/\/t.co\/NCBPCL06ZW"}
{"Tweets":"RT @WDHN: Power trucks are currently lining the Florida state line as Hurricane Michael comes closer and closer.\n\nFor more updates on the s…"}
{"Tweets":"Power trucks are currently lining the Florida state line as Hurricane Michael comes closer and closer.\n\nFor more up… https:\/\/t.co\/ezkempTRnK"}
{"Tweets":"RT @WDHN: The offer affects both pre-paid and post-paid customers. https:\/\/t.co\/0LCObPWEEY"}
{"Tweets":"The offer affects both pre-paid and post-paid customers. https:\/\/t.co\/0LCObPWEEY"}
{"Tweets":"Hurricane Michael is aiming for me, I lose power during normal storms so this is going to be horrible.  Not looking… https:\/\/t.co\/Po4ew1xmKw"}
{"Tweets":"RT @WTVYNews4: Houston County commissioners met Tuesday morning, and Hurricane Michael was their top priority.  Houston County's Emergency…"}
{"Tweets":"The office at Highlands Trail Apartments will be CLOSED tomorrow October 10, 2018 due to Hurricane Michael. We ask… https:\/\/t.co\/3TfCEYyABp"}
{"Tweets":"#Michael\nComcast Opens Free Xfinity WiFi Service to Aid Residents, Emergency Personnel as Hurricane Michael Approaches"}
{"Tweets":"RT @HoustonCntyCom: Houston County offices will be closed Wednesday due to potential of hazardous weather resulting from Hurricane Michael.…"}
{"Tweets":"RT @WTVYNews4: Houston County commissioners met Tuesday morning, and Hurricane Michael was their top priority.  Houston County's Emergency…"}
{"Tweets":"RT @WTVYNews4: Houston County commissioners met Tuesday morning, and Hurricane Michael was their top priority.  Houston County's Emergency…"}
{"Tweets":"Due to Hurricane Michael the Exchange Center will be closed on Wednesday, Oct. 10"}
{"Tweets":"As our area prepares for Hurricane Michael, our offices will be closed tomorrow. We plan to reopen Thursday. if you… https:\/\/t.co\/02KxEH297Q"}
{"Tweets":"Houston County commissioners met Tuesday morning, and Hurricane Michael was their top priority.  Houston County's E… https:\/\/t.co\/CJjvSwVw6n"}
{"Tweets":"RT @dothaneagle: Tuesday morning update: Hurricane Michael https:\/\/t.co\/ejO05zfdPf https:\/\/t.co\/8YGi3TlNZj"}
{"Tweets":"Early evacuation is finishing up. Kids are excited for a day off and parents are preparing for Hurricane Michael to… https:\/\/t.co\/tSeoGWZRMU"}
{"Tweets":"Hurricane Michael is poised to become the most powerful storm to hit the Florida Panhandle in decades: https:\/\/t.co\/jm1s891da6 via @slate"}
{"Tweets":"Hurricane Michael is heading our way! Due to the threat of bad weather and your safety being our main concern, we w… https:\/\/t.co\/c23p0CHAtQ"}
{"Tweets":"Hurricane Michael city-by-city forecast https:\/\/t.co\/ztpcA0qLWr"}
{"Tweets":"@weatherchannel #HurricaneMichael I am in south east Dothan Alabama, what can I expect from Hurricane Michael and s… https:\/\/t.co\/aGikfWydhY"}
{"Tweets":"@JimCantore Jim, I am in Dothan Alabama,  what should I expect from Hurricane Michael,  I am 60 miles from Panama City Beach Florida."}
{"Tweets":"A little humor in all the seriousness...\n\nhttps:\/\/t.co\/slrPJLczwf"}
{"Tweets":"The more news I hear about hurricane Michael, the more nervous I get.. https:\/\/t.co\/HXxFgloXCH"}
{"Tweets":"Hurricane Michael update in Bonifay part 2 @WDHN https:\/\/t.co\/lvWzP34hPF"}
{"Tweets":"Hurricane Michael update in Bonifay https:\/\/t.co\/v6rYTOuI1y"}
{"Tweets":"Due to Hurricane Michael, Emfinger Steel will be closed on Wednesday, October 10th.  We hope you and your family stay safe during this time."}
{"Tweets":"List of shelters to open; schools, businesses closing ahead of Hurricane Michael https:\/\/t.co\/bx8RHHXAOp https:\/\/t.co\/glORY2XfEv"}
{"Tweets":"The Wiregrass Museum of Art will be closed on Wednesday, October 10, due to Hurricane Michael. Please stay tuned fo… https:\/\/t.co\/PLc5CLpg9X"}
{"Tweets":"RT @WTVYNews4: https:\/\/t.co\/dcFdHuQm4p"}
{"Tweets":"When will Hurricane Michael make landfall? Will temperatures stay warm or cool down? Here is the forecast for South… https:\/\/t.co\/sewgn7GRDZ"}
{"Tweets":"What am I doing ahead of Hurricane #Michael?  Bracing my wooden fence, clearing my patio, making sure I have fuel,… https:\/\/t.co\/tMl6tE5onb"}
{"Tweets":"#HurricaneQuestions @weatherchannel Is hurricane Michael going to turn anymore? I’m trying to play Fortnite and I r… https:\/\/t.co\/HsW8tObvZW"}
{"Tweets":"Dothan Utilities customers, with Hurricane Michael headed our way, please take a moment to register for the new pow… https:\/\/t.co\/bM7TxTljLU"}
{"Tweets":"Our offices, warehouses, and production departments will be closed tomorrow in preparation for Hurricane Michael. D… https:\/\/t.co\/b8XjXCrR8u"}
{"Tweets":"#Michael\nSoutheast Health Cancels Elective Surgeries \n\nThe latest projection has Hurricane Michael making landfall… https:\/\/t.co\/DltBNZwEak"}
{"Tweets":"WEATHER UPDATE \n\nDue to hurricane Michael and it’s potential impacts to the Wiregrass area, Ridgecrest Baptist Chur… https:\/\/t.co\/DPw0fl3BGG"}
{"Tweets":"Outside my house last night #hurricane #Michael @weatherchannel #weatherchannel https:\/\/t.co\/i2XI7ltje3"}
{"Tweets":"AccuWeather predicts that Hurricane Michael’s total damage and economic impact in the U.S. will be close to $15 bil… https:\/\/t.co\/snSNSqY7Wc"}
{"Tweets":"Lauren, Erin, Ryan and Logan are relieving stress from midterms and preparing for Hurricane Michael! #puzzle… https:\/\/t.co\/yjhzd2ZKOv"}
{"Tweets":"RT @wxevan: Michael is a category 2 hurricane moving NNW at 12 mph, still on track to make landfall tomorrow afternoon near Panama City. Hu…"}
{"Tweets":"Hurricane Michael Resources for the Wiregrass Region: https:\/\/t.co\/X1wlCgc1Su"}
{"Tweets":"Michael is a category 2 hurricane moving NNW at 12 mph, still on track to make landfall tomorrow afternoon near Pan… https:\/\/t.co\/gvyGFkNbSE"}
{"Tweets":"Houston County offices will be closed Wednesday due to potential of hazardous weather resulting from Hurricane Mich… https:\/\/t.co\/yDdI3rmDXA"}
{"Tweets":"RT @WDHN: Wiregrass Area Hurricane Michael Resources and list of open shelters\n\nhttps:\/\/t.co\/UHyYCBdTze"}
{"Tweets":"RT @mandymcqueentv: Hurricane #Michael: Keeping your pets safe during the storm\n\nhttps:\/\/t.co\/wpQhy4PKVf"}
{"Tweets":"Hurricane #Michael: Keeping your pets safe during the storm\n\nhttps:\/\/t.co\/wpQhy4PKVf"}
{"Tweets":"RT @WDHN: Wiregrass Area Hurricane Michael Resources and list of open shelters\n\nhttps:\/\/t.co\/UHyYCBdTze"}
{"Tweets":"Tuesday morning update: Hurricane Michael https:\/\/t.co\/ejO05zfdPf https:\/\/t.co\/8YGi3TlNZj"}
{"Tweets":"RT @WDHN: Wiregrass Area Hurricane Michael Resources and list of open shelters\n\nhttps:\/\/t.co\/UHyYCBdTze"}
{"Tweets":"RT @WDHN: Wiregrass Area Hurricane Michael Resources and list of open shelters\n\nhttps:\/\/t.co\/UHyYCBdTze"}
{"Tweets":"Wiregrass Area Hurricane Michael Resources and list of open shelters\n\nhttps:\/\/t.co\/UHyYCBdTze"}
{"Tweets":"Flowers Hospital announces updates regarding Hurricane Michael preparations\n\nhttps:\/\/t.co\/hPynWnP3cI"}
{"Tweets":"RT @WTVYNews4: https:\/\/t.co\/dcFdHuQm4p"}
{"Tweets":"https:\/\/t.co\/dcFdHuQm4p"}
{"Tweets":"RT @WTVYNews4: Latest preps for Michael and a list of things you may need to ride out the storm #michael https:\/\/t.co\/lf7MPXI9Wp"}
{"Tweets":"Hurricane Michael on collision course with Florida’s Gulf Coast and is predicted to reach Category 3 https:\/\/t.co\/qvfVZm6Ive"}
{"Tweets":"RT @Wiregrass211: Hurricane Evacuees – Safe Haven Shelter Opening in Dothan Tuesday, October 9th \n\nBeginning at 8 a.m. Tuesday October 9th,…"}
{"Tweets":"RT @mandymcqueentv: Michael is a strong Category 1 this AM, and is expected to continue strengthening through the day, becoming a Major hur…"}
{"Tweets":"RT @mandymcqueentv: Michael is a strong Category 1 this AM, and is expected to continue strengthening through the day, becoming a Major hur…"}
{"Tweets":"RT @mandymcqueentv: Michael is a strong Category 1 this AM, and is expected to continue strengthening through the day, becoming a Major hur…"}
{"Tweets":"Michael is a strong Category 1 this AM, and is expected to continue strengthening through the day, becoming a Major… https:\/\/t.co\/NRDAmCc3kr"}
{"Tweets":"So hurricane Michael is coming in.. and instead of me being worried about people... I’m worried about all of the an… https:\/\/t.co\/PrBL1H2luW"}
{"Tweets":"RT @WDHN: There was a steady stream of traffic of Highway 231 as people tried to get out of the storm's way. https:\/\/t.co\/qex8DqNjHO"}
{"Tweets":"RT @WDHN: Meteorologist Griffin Hardy has the latest on what to expect in Southeast Alabama from Hurricane #Michael. #ALwx #GAwx #FLwx\nhttp…"}
{"Tweets":"Meteorologist Griffin Hardy has the latest on what to expect in Southeast Alabama from Hurricane #Michael. #ALwx… https:\/\/t.co\/1Ulpb974wa"}
{"Tweets":"Hurricane #Michael continues to strengthen. This storm needs to be taken seriously, if you have have concerns about… https:\/\/t.co\/SnStaqS1ot"}
{"Tweets":"There was a steady stream of traffic of Highway 231 as people tried to get out of the storm's way. https:\/\/t.co\/qex8DqNjHO"}
{"Tweets":"RT @Wiregrass211: Hurricane Evacuees – Safe Haven Shelter Opening in Dothan Tuesday, October 9th \n\nBeginning at 8 a.m. Tuesday October 9th,…"}
{"Tweets":"RT @WTVYNews4: Latest preps for Michael and a list of things you may need to ride out the storm #michael https:\/\/t.co\/lf7MPXI9Wp"}
{"Tweets":"RT @WTVYNews4: Latest preps for Michael and a list of things you may need to ride out the storm #michael https:\/\/t.co\/lf7MPXI9Wp"}
{"Tweets":"Everyone knows! #JimCantore &gt; Florida sheriff's office issues 'trespass warning' for Jim Cantore ahead of Hurricane… https:\/\/t.co\/OFgC7bSqj8"}
{"Tweets":"RT @Wiregrass211: Hurricane Evacuees – Safe Haven Shelter Opening in Dothan Tuesday, October 9th \n\nBeginning at 8 a.m. Tuesday October 9th,…"}
{"Tweets":"RT @WTVYNews4: Latest preps for Michael and a list of things you may need to ride out the storm #michael https:\/\/t.co\/lf7MPXI9Wp"}
{"Tweets":"RT @Wiregrass211: Hurricane Evacuees – Safe Haven Shelter Opening in Dothan Tuesday, October 9th \n\nBeginning at 8 a.m. Tuesday October 9th,…"}
{"Tweets":"RT @WTVYNews4: Latest preps for Michael and a list of things you may need to ride out the storm #michael https:\/\/t.co\/lf7MPXI9Wp"}
{"Tweets":"RT @WTVYNews4: Latest preps for Michael and a list of things you may need to ride out the storm #michael https:\/\/t.co\/lf7MPXI9Wp"}
{"Tweets":"RT @Wiregrass211: Hurricane Evacuees – Safe Haven Shelter Opening in Dothan Tuesday, October 9th \n\nBeginning at 8 a.m. Tuesday October 9th,…"}
{"Tweets":"RT @WTVYNews4: Latest preps for Michael and a list of things you may need to ride out the storm #michael https:\/\/t.co\/lf7MPXI9Wp"}
{"Tweets":"RT @WTVYNews4: Latest preps for Michael and a list of things you may need to ride out the storm #michael https:\/\/t.co\/lf7MPXI9Wp"}
{"Tweets":"Latest preps for Michael and a list of things you may need to ride out the storm #michael https:\/\/t.co\/lf7MPXI9Wp"}
{"Tweets":"Dothan City Schools will be closed on Tuesday due to Hurricane Michael https:\/\/t.co\/FiohU1FoIH"}
{"Tweets":"evacuated from the beach today last minute bc of hurricane michael and I don’t think I’ve ever said the f word more in my life"}
{"Tweets":"RT @AxitonD: In respect for families affected by Hurricane Michael, Axtion Air is extending our JUMP ALL DAY special through Thursday ($14.…"}
{"Tweets":"In respect for families affected by Hurricane Michael, Axtion Air is extending our JUMP ALL DAY special through Thu… https:\/\/t.co\/Ql6KPKtHVq"}
