{"Tweets":"RT @dothaneagle: Hurricane Michael devastates Jackson County https:\/\/t.co\/Kg4Ev3OlHR https:\/\/t.co\/4GC5Gljqd1"}
{"Tweets":"RT @WDHN: Crews are still working to bring power back, although the progress has slowed down a bit. https:\/\/t.co\/I8ORnJjd62"}
{"Tweets":"RT @dothaneagle: Hurricane Michael devastates Jackson County https:\/\/t.co\/Kg4Ev3OlHR https:\/\/t.co\/4GC5Gljqd1"}
{"Tweets":"Hurricane Michael devastates Jackson County https:\/\/t.co\/Kg4Ev3OlHR https:\/\/t.co\/4GC5Gljqd1"}
{"Tweets":"RT @rbcdothan: Our Disaster Relief teams have been hard at work this week cutting trees and cleanup following Hurricane Michael. We welcome…"}
{"Tweets":"Crews are still working to bring power back, although the progress has slowed down a bit. https:\/\/t.co\/I8ORnJjd62"}
{"Tweets":"Hurricane Michael was rough yall. My porch and carport were blown off of my house and every tree is down, I'm so th… https:\/\/t.co\/bNGHrjoNVO"}
{"Tweets":"RT @WDHN: Walt Disney Company donates $1M to help Hurricane Michael victims https:\/\/t.co\/xswOrDHS6e"}
{"Tweets":"RT @rbcdothan: Our Disaster Relief teams have been hard at work this week cutting trees and cleanup following Hurricane Michael. We welcome…"}
{"Tweets":"Our Disaster Relief teams have been hard at work this week cutting trees and cleanup following Hurricane Michael. W… https:\/\/t.co\/uCw9xgp0rZ"}
{"Tweets":"RT @dothaneagle: The aftermath of Hurricane Michael: Photos from around the Wiregrass https:\/\/t.co\/fIDJHiRnca https:\/\/t.co\/w8CahXoms8"}
{"Tweets":"Walt Disney Company donates $1M to help Hurricane Michael victims https:\/\/t.co\/xswOrDHS6e"}
{"Tweets":"RT @Wiregrass211: Hurricane Michael Feeding Locations:\n\nWebb- \nWebb, AL Feeding at park in Webb\nToday Saturday, October 13th 12:00 Noon\nAsh…"}
{"Tweets":"Hurricane Michael Feeding Locations:\n\nWebb- \nWebb, AL Feeding at park in Webb\nToday Saturday, October 13th 12:00 No… https:\/\/t.co\/EMb1JRnekp"}
{"Tweets":"RT @dothaneagle: “President Donald J. Trump declared that an emergency exists in the State of Alabama resulting from Hurricane Michael begi…"}
{"Tweets":"“President Donald J. Trump declared that an emergency exists in the State of Alabama resulting from Hurricane Micha… https:\/\/t.co\/DPWdiaEHzu"}
{"Tweets":"RT @WTVYNews4: What an awful loss for the cotton industry here in the Wiregrass. https:\/\/t.co\/tz00rG6Thr"}
{"Tweets":"Michael Madness: The Hurricane Rolled Through https:\/\/t.co\/wpEFQ3DAP0 https:\/\/t.co\/glxUUZCWrM"}
{"Tweets":"Wiregrass Hurricane Michael notebook https:\/\/t.co\/vFjRsRBqiY via @dothaneagle"}
{"Tweets":"Please go to the link below to get updates from Dothan Utilities regarding power outage management.  Thanks… https:\/\/t.co\/QMUlQwdqW1"}
{"Tweets":"RT @DHNFireChief: Dothan Utilities Hurricane Michael Update Report https:\/\/t.co\/tf9Vjyo0Rv"}
{"Tweets":"Dothan Utilities Hurricane Michael Update Report https:\/\/t.co\/tf9Vjyo0Rv"}
{"Tweets":"RT @EagleLance: The photos from Jackson County are incredible. ...  https:\/\/t.co\/hS3ENo77p7"}
{"Tweets":"RT @Wiregrass211: Devastating Before And After Images Show Hurricane Michael's Destruction https:\/\/t.co\/CoyJYA07n4"}
{"Tweets":"RT @Wiregrass211: Dothan Utilities Hurricane Michael - October 12, 2018 at 1:15 pm\n\nLess Than 12,000 customers without power currently (24,…"}
{"Tweets":"RT @DevonSellers: Our Brooke Richardson has been in #PortStJoe since Tuesday. I'm so happy to know she made it through Hurricane Michael, a…"}
{"Tweets":"RT @WTVYNews4: What an awful loss for the cotton industry here in the Wiregrass. https:\/\/t.co\/tz00rG6Thr"}
{"Tweets":"What an awful loss for the cotton industry here in the Wiregrass. https:\/\/t.co\/tz00rG6Thr"}
{"Tweets":"What an awful loss for the cotton industry here in the Wiregrass.\nhttps:\/\/t.co\/7wlqIWuErD"}
{"Tweets":"Our Brooke Richardson has been in #PortStJoe since Tuesday. I'm so happy to know she made it through Hurricane Mich… https:\/\/t.co\/2JvoGvzV0D"}
{"Tweets":"RT @WDHN: Death toll from Hurricane Michael rises to 14 https:\/\/t.co\/pSCG6zKGIu"}
{"Tweets":"Death toll from Hurricane Michael rises to 14 https:\/\/t.co\/pSCG6zKGIu"}
{"Tweets":"RT @Wiregrass211: Dothan Utilities Hurricane Michael - October 12, 2018 at 1:15 pm\n\nLess Than 12,000 customers without power currently (24,…"}
{"Tweets":"Months and of hard work gone, wiped out in an instant. https:\/\/t.co\/nFin47nPpg"}
{"Tweets":"RT @DevonSellers: MEXICO BEACH: Heartbreaking news Friday afternoon. Search and rescue efforts have uncovered bodies in the destruction lef…"}
{"Tweets":"I am back on Twitter for a few minutes anyway. Just wanted to say Hurricane Michael was the scariest thing I have w… https:\/\/t.co\/irmnraYi2V"}
{"Tweets":"RT @Wiregrass211: Dothan Utilities Hurricane Michael - October 12, 2018 at 1:15 pm\n\nLess Than 12,000 customers without power currently (24,…"}
{"Tweets":"If you are in need of assistance in the aftermath of Hurricane Michael, please text or call 334-377-3877 with your… https:\/\/t.co\/uJVkoGbTW6"}
