{"Tweets":"WCCD students &amp; employees: If you have been impacted by Hurricane Michael and need a hot meal, stop by the Presiden… https:\/\/t.co\/rBAkL4cImf"}
{"Tweets":"Just an update on what's going on in Jeffers world and our local area after Hurricane Michael. https:\/\/t.co\/OoODC0J18g"}
{"Tweets":"When will the Hurricane Michael Relief Benefit Concerts with Luke Bryan, Brother Osbourne, or Jason Aldean start?"}
{"Tweets":"@DavidBurtonEv *Hurricane Michael"}
{"Tweets":"RT @DevonSellers: MEXICO BEACH: Heartbreaking news Friday afternoon. Search and rescue efforts have uncovered bodies in the destruction lef…"}
{"Tweets":"Alabama farmers lost $100 million in cotton crops due to Hurricane Michael https:\/\/t.co\/WLOza4m8Q5"}
{"Tweets":"Dothan Utilities Hurricane Michael Update 5:30am\n3,900 Customers without power.  Thanks for your patience.  This ha… https:\/\/t.co\/QtgQO6YOGA"}
{"Tweets":"RT @dothaneagle: “President Donald J. Trump declared that an emergency exists in the State of Alabama resulting from Hurricane Michael begi…"}
{"Tweets":"RT @dothaneagle: Hurricane Michael devastates Jackson County https:\/\/t.co\/Kg4Ev3OlHR https:\/\/t.co\/4GC5Gljqd1"}
{"Tweets":"Hurricane Michael's impact may stretch into the voting season. https:\/\/t.co\/JeWC0o8bqD"}
{"Tweets":"Hurricane Michael's impact may stretch into the voting season. https:\/\/t.co\/bi9PHUE3gH"}
{"Tweets":"RT @WDHN: UPDATE: Pea River Electric has restored power to all customers. Dothan Utilities has also released more information about its own…"}
{"Tweets":"UPDATE: Pea River Electric has restored power to all customers. Dothan Utilities has also released more information… https:\/\/t.co\/PriwAtFhU3"}
{"Tweets":"RT @WDHN: Dothan City Schools closed Oct. 15 through Oct. 19 after buildings damaged by Hurricane Michael  https:\/\/t.co\/KzPyNZiz6w"}
{"Tweets":"RT @WDHN: Dothan City Schools closed Oct. 15 through Oct. 19 after buildings damaged by Hurricane Michael  https:\/\/t.co\/KzPyNZiz6w"}
{"Tweets":"RT @WDHN: Dothan City Schools closed Oct. 15 through Oct. 19 after buildings damaged by Hurricane Michael  https:\/\/t.co\/KzPyNZiz6w"}
{"Tweets":"Dothan City Schools closed Oct. 15 through Oct. 19 after buildings damaged by Hurricane Michael  https:\/\/t.co\/KzPyNZiz6w"}
