{"Tweets":"Surveying efforts from the USACE Mobile District quickly restored navigation channels in the aftermath of Hurricane… https:\/\/t.co\/yrkcMnKWc5"}
{"Tweets":"Brig. Gen. Holland, commander,USACE South Atlantic Division, and Col. Sebastian Joly, commander, USACE Mobile Distr… https:\/\/t.co\/MOpo0ZtMCC"}
{"Tweets":"The U.S. Army Corps of Engineers Mobile District Panama City office, after the office was damaged by Hurricane Mich… https:\/\/t.co\/pT7HoRcnVI"}
{"Tweets":"Hurricane Michael will likely cause higher insurance rates in Alabama, expert says\nhttps:\/\/t.co\/NOlcdaR552 https:\/\/t.co\/ZJ7ditXxYE"}
{"Tweets":"The U.S. Army Corps of Engineers Mobile District project, the Jim Woodruff Lock &amp; Dam, suffered tree damage and is… https:\/\/t.co\/E8YEOIWQRO"}
{"Tweets":"RT @NWSMobile: 🌀Hurricane #Michael Tip - NEVER use a generator in garage, basement, shed or indoors after the storm. Use outside away from…"}
{"Tweets":"RT @FOX10News: Newk's in McGowin Park closed temporarily to assist in Hurricane Michael relief https:\/\/t.co\/MVhGVy7ZbA"}
{"Tweets":"RT @FOX10News: Newk's in McGowin Park closed temporarily to assist in Hurricane Michael relief https:\/\/t.co\/MVhGVy7ZbA"}
{"Tweets":"RT @rmertel: Hurricane survivors scramble for food and water in Florida. Oh but no worries, Trump has his 250,000 a plate fund raiser.  Who…"}
{"Tweets":"Newk's in McGowin Park closed temporarily to assist in Hurricane Michael relief https:\/\/t.co\/MVhGVy7ZbA"}
{"Tweets":"Continued prayers for everyone effected by Hurricane Michael who will feel the impact for months and years to come!… https:\/\/t.co\/qaWeiX97oD"}
{"Tweets":"Hurricane survivors scramble for food and water in Florida. Oh but no worries, Trump has his 250,000 a plate fund r… https:\/\/t.co\/Cfbw6hcEcO"}
{"Tweets":"More footage from road near to Panama City in the aftermath of Hurricane Michael. https:\/\/t.co\/UrwhMlak9T"}
{"Tweets":"An entire truck flipped on its side after Hurricane Michael made landfall over the the city Wednesday. https:\/\/t.co\/wvrCL3ko94"}
{"Tweets":"The state of the roads near Panama City in the immediate aftermath of Hurricane Michael. https:\/\/t.co\/kUB3t1HAfK"}
{"Tweets":"Our office is hard at work today. We have a great group of dedicated staff to help people with claims from Hurrican… https:\/\/t.co\/UtKCtxwG0P"}
{"Tweets":"RT @ALcomMobile: President Trump approves Hurricane Michael disaster relief for 4 Alabama counties https:\/\/t.co\/GLndHj5GSG"}
{"Tweets":"President Trump approves Hurricane Michael disaster relief for 4 Alabama counties https:\/\/t.co\/GLndHj5GSG"}
{"Tweets":"RT @Michael91689: Unreal video on a go pro of hurricane michael. Give it a look. https:\/\/t.co\/v54erX2tuR"}
{"Tweets":"SEARCHING FOR SURVIVORS: People in Florida continue to search through the wreckage and debris for those who went mi… https:\/\/t.co\/s1HPBOJSBh"}
{"Tweets":"RT @FOX10News: Newk's restaurant in McGowin Park packaged boxes of food for Hurricane Michael relief https:\/\/t.co\/OOaFZ6C0We"}
{"Tweets":"Unreal video on a go pro of hurricane michael. Give it a look. https:\/\/t.co\/v54erX2tuR"}
{"Tweets":"RT @ALcomMobile: After Hurricane Michael, activists request BP money to combat climate change https:\/\/t.co\/4fFhhAFgyt"}
{"Tweets":"Nurses and other healthcare providers were required to wear identification bands while working during Hurricane Mic… https:\/\/t.co\/dP3ANRhWKx"}
{"Tweets":"Join us for our Worship Experience tomorrow at 10am as we continue with Part 6 of “The Power of Vision” &amp; begin col… https:\/\/t.co\/bZcpdxk2zH"}
{"Tweets":"Hurricane Michael's winds topple Florida freight train https:\/\/t.co\/mNSqzJu5uU via @abc7newsbayarea"}
{"Tweets":"RT @NWSMobile: 🏠 #Michael Tip: Taping windows does NOTHING to protect from the wind during a hurricane. #BePrepared #HurricaneStrong https:…"}
{"Tweets":"On the way to help our brothers and sisters that were affected by hurricane Michael Your Alabama Family is coming t… https:\/\/t.co\/Pge5w4eC2n"}
{"Tweets":"After Hurricane Michael, activists request BP money to combat climate change https:\/\/t.co\/4fFhhAFgyt"}
{"Tweets":"RT @TaylorSarallo: THANK YOU: $26,283 pledged during WKRG Red Cross telethon for Hurricane Michael relief. Thank you to everyone who donate…"}
{"Tweets":"RT @TaylorSarallo: THANK YOU: $26,283 pledged during WKRG Red Cross telethon for Hurricane Michael relief. Thank you to everyone who donate…"}
{"Tweets":"THANK YOU: $26,283 pledged during WKRG Red Cross telethon for Hurricane Michael relief. Thank you to everyone who d… https:\/\/t.co\/AcidZRAIBy"}
{"Tweets":"Hurricane Michael is one of the strongest storms ever to hit the American mainland. In the future hurricanes are on… https:\/\/t.co\/UC9sG91raO"}
{"Tweets":"RT @ChrisDunnWX: STUNNING IMAGES, before and after #Hurricane #Michael from Mexico Beach and Cape San Blas, Florida. https:\/\/t.co\/5jS10xczp6"}
{"Tweets":"RT @ChrisDunnWX: STUNNING IMAGES, before and after #Hurricane #Michael from Mexico Beach and Cape San Blas, Florida. https:\/\/t.co\/5jS10xczp6"}
{"Tweets":"RT @NWSMobile: Please try to pass this important information along to folks impacted by Hurricane #Michael. These are important tips to sta…"}
{"Tweets":"RT @NWSMobile: 🌀Hurricane #Michael Tip - NEVER use a generator in garage, basement, shed or indoors after the storm. Use outside away from…"}
{"Tweets":"RT @NWSMobile: 🌀Hurricane #Michael Tip - NEVER use a generator in garage, basement, shed or indoors after the storm. Use outside away from…"}
{"Tweets":"WKRG Employee learns his aunt survived Hurricane Michael by news crews armed with 2 way radios. https:\/\/t.co\/5WXFmMKCTg"}
{"Tweets":"Newk's restaurant in McGowin Park packaged boxes of food for Hurricane Michael relief https:\/\/t.co\/OOaFZ6C0We"}
{"Tweets":"How to see what your street looks like after Hurricane Michael https:\/\/t.co\/7nw0Vbifw2"}
{"Tweets":"Hurricane Michael Resources for AL Public Libraries\n\nhttps:\/\/t.co\/gsY02m13rw"}
